
var deleteDuplication = false;
var numberCounter = 0;

function checkboxResponse() {
    if (document.getElementById('checkbox').checked == true) {
        deleteDuplication = true;
        let e = document.getElementById('list').innerHTML = '(중복 제거 켜진 경우) 나온 단어 리스트';
        numberCounter = 0;
        document.getElementById('numbering').style.opacity = "1";

    } else {

        document.getElementById('numbering').style.opacity = "0";

        deleteDuplication = false;
        words = ["象","豚","矢","羽","禾","乾燥","濕潤","分配","稀少","蒸發","觸媒","生態系","捕食","被食","觀測","軌道","儀軌","末","竝","館","霜","想","梅","每","海","靑","淸","請","情","斤","分析","詠","囚","道","桑","楊","柱","枯","榤","慢","濟","壓","點","龜","龍","似","茶","鷄肋","均衡","基礎","栽培","堤防","金塊","環境","墓碑","崩壞","壇","載","板","瞬","怪","恐","裂","覆","博","白眉","拳銃","拳鬪","搜査","搜索","管掌","合掌","機械","機構","機智","戲弄","侵犯","封鎖","背反","違背","奪取","逸脫","盲腸","胃腸","收奪","蜂起","燒却","報告","照準","成熟","陣營","乾燥","華燭","爆擊","火爐","沿岸","團束","區域","徹底","障壁"]
        meanings = ["코끼리/모양 상", "돼지 돈", "화살 시", "깃/날개 우", "벼 화", "마름 건조", "축축함 습윤", "나누어 줌 분배", "드묾 희소", "액체가 기체로 변함 증발", "반응을 빠르게 하는 물질 촉매", "생물과 환경의 관계 체계 생태계", "먹이를 잡아먹음 포식", "먹이가 됨 피식", "관찰하여 측정함 관측", "물체가 도는 길 궤도", "의식 절차 기록 의궤", "끝 말", "나란히 함 병", "집/건물 관", "서리 상", "생각 상", "매화 매", "매번 매", "바다 해", "푸름 청", "맑음 청", "청하다/요청 청", "마음/정서 정", "도끼 근", "쪼갬/분석 석", "읊다 영", "가둘 수", "길 도", "뽕나무 상", "버드나무 양", "기둥 주", "마름 고", "나무 이름 걸", "게으름 만", "건너다/구제 제", "누름 압", "점/찍다 점", "거북 귀", "용 룡", "같다 사", "차 다", "버리기 아까운 것 계륵", "고르게 함 균형", "기초 기초", "기르다 재배", "둑 제방", "금 덩어리 금괴", "둘러싼 상태 환경", "무덤 비석 묘비", "무너짐 붕괴", "제단 단", "싣다 재", "널 판", "순간 순", "괴이하다 괴", "두렵다 공", "찢어짐 열", "뒤집다 복", "넓다/많이 알다 박", "가장 뛰어남 백미", "권총 권총", "권투 권투", "조사 수사", "찾다 수색", "맡아 다스림 관장", "손 모아 절함 합장", "기계 기계", "구조 기구", "재치 기지", "희롱하다 희롱", "침범하다 침범", "봉함 봉쇄", "서로 어긋남 배반", "어김 위배", "빼앗음 탈취", "달아남 일탈", "막창 맹장", "위와 창자 위장", "빼앗음 수탈", "벌떼처럼 일어남 봉기", "불태움 소각", "알림 보고", "겨냥 조준", "익음 성숙", "집단 진영", "마름 건조", "혼례 촛불 화촉", "폭발 공격 폭격", "불 화로", "물가 연안", "묶음 단속", "구획 구역", "철저함 철저", "막는 벽 장벽"]
    }
}

let words = ["象","豚","矢","羽","禾","乾燥","濕潤","分配","稀少","蒸發","觸媒","生態系","捕食","被食","觀測","軌道","儀軌","末","竝","館","霜","想","梅","每","海","靑","淸","請","情","斤","分析","詠","囚","道","桑","楊","柱","枯","榤","慢","濟","壓","點","龜","龍","似","茶","鷄肋","均衡","基礎","栽培","堤防","金塊","環境","墓碑","崩壞","壇","載","板","瞬","怪","恐","裂","覆","博","白眉","拳銃","拳鬪","搜査","搜索","管掌","合掌","機械","機構","機智","戲弄","侵犯","封鎖","背反","違背","奪取","逸脫","盲腸","胃腸","收奪","蜂起","燒却","報告","照準","成熟","陣營","乾燥","華燭","爆擊","火爐","沿岸","團束","區域","徹底","障壁"]
let meanings = ["코끼리/모양 상", "돼지 돈", "화살 시", "깃/날개 우", "벼 화", "마름 건조", "축축함 습윤", "나누어 줌 분배", "드묾 희소", "액체가 기체로 변함 증발", "반응을 빠르게 하는 물질 촉매", "생물과 환경의 관계 체계 생태계", "먹이를 잡아먹음 포식", "먹이가 됨 피식", "관찰하여 측정함 관측", "물체가 도는 길 궤도", "의식 절차 기록 의궤", "끝 말", "나란히 함 병", "집/건물 관", "서리 상", "생각 상", "매화 매", "매번 매", "바다 해", "푸름 청", "맑음 청", "청하다/요청 청", "마음/정서 정", "도끼 근", "쪼갬/분석 석", "읊다 영", "가둘 수", "길 도", "뽕나무 상", "버드나무 양", "기둥 주", "마름 고", "나무 이름 걸", "게으름 만", "건너다/구제 제", "누름 압", "점/찍다 점", "거북 귀", "용 룡", "같다 사", "차 다", "버리기 아까운 것 계륵", "고르게 함 균형", "기초 기초", "기르다 재배", "둑 제방", "금 덩어리 금괴", "둘러싼 상태 환경", "무덤 비석 묘비", "무너짐 붕괴", "제단 단", "싣다 재", "널 판", "순간 순", "괴이하다 괴", "두렵다 공", "찢어짐 열", "뒤집다 복", "넓다/많이 알다 박", "가장 뛰어남 백미", "권총 권총", "권투 권투", "조사 수사", "찾다 수색", "맡아 다스림 관장", "손 모아 절함 합장", "기계 기계", "구조 기구", "재치 기지", "희롱하다 희롱", "침범하다 침범", "봉함 봉쇄", "서로 어긋남 배반", "어김 위배", "빼앗음 탈취", "달아남 일탈", "막창 맹장", "위와 창자 위장", "빼앗음 수탈", "벌떼처럼 일어남 봉기", "불태움 소각", "알림 보고", "겨냥 조준", "익음 성숙", "집단 진영", "마름 건조", "혼례 촛불 화촉", "폭발 공격 폭격", "불 화로", "물가 연안", "묶음 단속", "구획 구역", "철저함 철저", "막는 벽 장벽"]
var nextMeaning;

function mixWords() {
    if (words.length > 0) {
        document.getElementById('wordMeanings').style.opacity = "0";

        let r = Math.floor(Math.random() * words.length);

        document.getElementById('randomWords').innerHTML = words[r];
        document.getElementById('wordMeanings').innerHTML = meanings[r];

        if (deleteDuplication == true) {

            numberCounter++;
            document.getElementById('numbering').innerHTML = `현재까지 나온 단어 수: ${numberCounter}/95개`;

            if (!nextMeaning) nextMeaning = '';

            let e = document.getElementById('list');
            e.innerHTML = e.innerHTML + `${nextMeaning}<br>${words[r]} - `;

            nextMeaning = meanings[r];

            words.splice(r, 1);
            meanings.splice(r, 1);
        }
    } else {
        document.getElementById('randomWords').innerHTML = '모든 단어를 학습했어요.';
        document.getElementById('wordMeanings').innerHTML = '새로고침으로 복습할 수 있어요.';
    }

}

function wordMeanings() {
    document.getElementById('wordMeanings').style.opacity = "1";
}