
var deleteDuplication = false;
var numberCounter = 0;

function checkboxResponse() {
    if (document.getElementById('checkbox').checked == true) {
        deleteDuplication = true;
        let e = document.getElementById('list').innerHTML = '(중복 제거 켜진 경우) 나온 단어 리스트';
        numberCounter = 0;
        document.getElementById('numbering').style.opacity = "1";

    } else {

        document.getElementById('numbering').style.opacity = "0";

        deleteDuplication = false;
        words =  ["烏","飛","梨","落","騎","馬","欲","率","奴","積","功","之","塔","不","休","十","番","一","時","還","成","農","夫","餓","死","枕","厥","種","子","鷄","卵","有","骨","努","力","總","勞","績","卑","劣","優","激","勵","奬","拂","償","返","實","吐","貪","憤","怒","可","憐","戀","慕","志","者","事","竟","也","人","必","自","侮","然","後","勤","爲","無","價","寶","愼","是","護","身","符","內","足","基","辭","煩","心","主","荒","磨","斧","作","針","負","債","部","下","貢","納","獻","販","賣","促","貸","與","賃","擁","衛","警","懇","切","沒","頭","目","標","忍","耐","覺","悟","角","逐","德","孤","隣","三","行","我","師","焉","海","存","知","己","天","涯","若","比","古","言","朋","友","或","稱","第","二","吾","管","鮑","交","手","筆","鉛","規","範","模","篤","敦","名","簿","帳","蝶","泳","映","像","健","康","騷","亂","閱","覽","以","傳","熱","治","勢","傾","則","絶","利","窮","散","太","山","讓","土","壤","故","能","其","大","河","擇","細","流","就","深","畫","龍","點","睛","紀","綱","世","階","級","昇","組","員","織","經","緯","寫","眞","冒","險","羅","盤","操","縱","士","指","揮","涉","獵","孔"];
        meanings = ["까마귀 오","날 비","배 리","떨어질 락","말 탈 기","말 마","하고자 할 욕","거느릴 솔","종 노","쌓을 적","공 공","갈 지","탑 탑","아닐 불","쉴 휴","열 십","차례 번","한 일","때 시","돌아올 환","이룰 성","농사 농","지아비 부","주릴 아","죽을 사","베개 침","그 궐","씨 종","아들 자","닭 계","알 란","있을 유","뼈 골","힘쓸 노","힘 력","모을 총","공로 로","길쌈 적","낮을 비","못할 렬","나을 우","격할 격","힘쓸 려","권면할 장","떨칠 불","갚을 상","돌이킬 반","열매 실","토할 토","탐할 탐","분할 분","성낼 노","옳을 가","불쌍할 련","그리워할 연","사모할 모","뜻 지","놈 자","일 사","마침내 경","어조사 야","사람 인","반드시 필","스스로 자","업신여길 모","그러할 연","뒤 후","부지런할 근","할 위","없을 무","값 가","보배 보","삼갈 신","옳을 시","보호할 호","몸 신","부적 부","안 내","족할 족","터 기","말씀 사","번거로울 번","마음 심","주인 주","거칠 황","갈 마","도끼 부","지을 작","바늘 침","질 부","빚 채","떼 부","아래 하","바칠 공","들일 납","바칠 헌","팔 판","팔 매","재촉할 촉","빌릴 대","더불 여","품팔이 임","안을 옹","지킬 위","경계할 경","간절할 간","끊을 절","잠길 몰","머리 두","눈 목","표할 표","참을 인","견딜 내","깨달을 각","깨달을 오","뿔 각","쫓을 축","덕 덕","외로울 고","이웃 린","석 삼","다닐 행","나 아","스승 사","어조사 언","바다 해","있을 존","알 지","자기 기","하늘 천","물가 애","같을 약","견줄 비","옛 고","말씀 언","벗 붕","벗 우","혹 혹","일컬을 칭","차례 제","두 이","나 오","대롱 관","절인 생선 포","사귈 교","손 수","붓 필","납 연","법 규","법 범","본뜰 모","도타울 독","도타울 돈","이름 명","장부 부","장부 부","나비 접","헤엄칠 영","비칠 영","모양 상","굳셀 건","편안할 강","떠들 소","어지러울 란","볼 열","볼 람","써 이","전할 전","더울 열","다스릴 치","형세 세","기울 경","곧 즉","끊을 절","이로울 리","궁할 궁","흩을 산","클 태","메 산","사양할 양","흙 토","흙덩이 양","연고 고","능할 능","그 기","큰 대","물 하","가릴 택","가늘 세","흐를 류","나아갈 취","깊을 심","그림 화","용 룡","점 점","눈동자 정","벼리 기","벼리 강","세상 세","섬돌 계","등급 급","오를 승","짤 조","인원 원","짤 직","지날 경","씨 위","베낄 사","참 진","무릅쓸 모","험할 험","벌일 라","소반 반","잡을 조","놓을 종","선비 사","가리킬 지","휘두를 휘","건널 섭","사냥 렵","구멍 공"];
    }
}

let words =  ["烏","飛","梨","落","騎","馬","欲","率","奴","積","功","之","塔","不","休","十","番","一","時","還","成","農","夫","餓","死","枕","厥","種","子","鷄","卵","有","骨","努","力","總","勞","績","卑","劣","優","激","勵","奬","拂","償","返","實","吐","貪","憤","怒","可","憐","戀","慕","志","者","事","竟","也","人","必","自","侮","然","後","勤","爲","無","價","寶","愼","是","護","身","符","內","足","基","辭","煩","心","主","荒","磨","斧","作","針","負","債","部","下","貢","納","獻","販","賣","促","貸","與","賃","擁","衛","警","懇","切","沒","頭","目","標","忍","耐","覺","悟","角","逐","德","孤","隣","三","行","我","師","焉","海","存","知","己","天","涯","若","比","古","言","朋","友","或","稱","第","二","吾","管","鮑","交","手","筆","鉛","規","範","模","篤","敦","名","簿","帳","蝶","泳","映","像","健","康","騷","亂","閱","覽","以","傳","熱","治","勢","傾","則","絶","利","窮","散","太","山","讓","土","壤","故","能","其","大","河","擇","細","流","就","深","畫","龍","點","睛","紀","綱","世","階","級","昇","組","員","織","經","緯","寫","眞","冒","險","羅","盤","操","縱","士","指","揮","涉","獵","孔"];
let meanings = ["까마귀 오","날 비","배 리","떨어질 락","말 탈 기","말 마","하고자 할 욕","거느릴 솔","종 노","쌓을 적","공 공","갈 지","탑 탑","아닐 불","쉴 휴","열 십","차례 번","한 일","때 시","돌아올 환","이룰 성","농사 농","지아비 부","주릴 아","죽을 사","베개 침","그 궐","씨 종","아들 자","닭 계","알 란","있을 유","뼈 골","힘쓸 노","힘 력","모을 총","공로 로","길쌈 적","낮을 비","못할 렬","나을 우","격할 격","힘쓸 려","권면할 장","떨칠 불","갚을 상","돌이킬 반","열매 실","토할 토","탐할 탐","분할 분","성낼 노","옳을 가","불쌍할 련","그리워할 연","사모할 모","뜻 지","놈 자","일 사","마침내 경","어조사 야","사람 인","반드시 필","스스로 자","업신여길 모","그러할 연","뒤 후","부지런할 근","할 위","없을 무","값 가","보배 보","삼갈 신","옳을 시","보호할 호","몸 신","부적 부","안 내","족할 족","터 기","말씀 사","번거로울 번","마음 심","주인 주","거칠 황","갈 마","도끼 부","지을 작","바늘 침","질 부","빚 채","떼 부","아래 하","바칠 공","들일 납","바칠 헌","팔 판","팔 매","재촉할 촉","빌릴 대","더불 여","품팔이 임","안을 옹","지킬 위","경계할 경","간절할 간","끊을 절","잠길 몰","머리 두","눈 목","표할 표","참을 인","견딜 내","깨달을 각","깨달을 오","뿔 각","쫓을 축","덕 덕","외로울 고","이웃 린","석 삼","다닐 행","나 아","스승 사","어조사 언","바다 해","있을 존","알 지","자기 기","하늘 천","물가 애","같을 약","견줄 비","옛 고","말씀 언","벗 붕","벗 우","혹 혹","일컬을 칭","차례 제","두 이","나 오","대롱 관","절인 생선 포","사귈 교","손 수","붓 필","납 연","법 규","법 범","본뜰 모","도타울 독","도타울 돈","이름 명","장부 부","장부 부","나비 접","헤엄칠 영","비칠 영","모양 상","굳셀 건","편안할 강","떠들 소","어지러울 란","볼 열","볼 람","써 이","전할 전","더울 열","다스릴 치","형세 세","기울 경","곧 즉","끊을 절","이로울 리","궁할 궁","흩을 산","클 태","메 산","사양할 양","흙 토","흙덩이 양","연고 고","능할 능","그 기","큰 대","물 하","가릴 택","가늘 세","흐를 류","나아갈 취","깊을 심","그림 화","용 룡","점 점","눈동자 정","벼리 기","벼리 강","세상 세","섬돌 계","등급 급","오를 승","짤 조","인원 원","짤 직","지날 경","씨 위","베낄 사","참 진","무릅쓸 모","험할 험","벌일 라","소반 반","잡을 조","놓을 종","선비 사","가리킬 지","휘두를 휘","건널 섭","사냥 렵","구멍 공"];
var nextMeaning;

function mixWords() {
    if (words.length > 0) {
        document.getElementById('wordMeanings').style.opacity = "0";

        let r = Math.floor(Math.random() * words.length);

        document.getElementById('randomWords').innerHTML = words[r];
        document.getElementById('wordMeanings').innerHTML = meanings[r];

        if (deleteDuplication == true) {

            numberCounter++;
            document.getElementById('numbering').innerHTML = `현재까지 나온 단어 수: ${numberCounter}/95개`;

            if (!nextMeaning) nextMeaning = '';

            let e = document.getElementById('list');
            e.innerHTML = e.innerHTML + `${nextMeaning}<br>${words[r]} - `;

            nextMeaning = meanings[r];

            words.splice(r, 1);
            meanings.splice(r, 1);
        }
    } else {
        document.getElementById('randomWords').innerHTML = '모든 단어를 학습했어요.';
        document.getElementById('wordMeanings').innerHTML = '새로고침으로 복습할 수 있어요.';
    }

}

function wordMeanings() {
    document.getElementById('wordMeanings').style.opacity = "1";
}