
var deleteDuplication = false;
var numberCounter = 0;

function checkboxResponse() {
    if (document.getElementById('checkbox').checked == true) {
        deleteDuplication = true;
        let e = document.getElementById('list').innerHTML = '(중복 제거 켜진 경우) 나온 단어 리스트';
        numberCounter = 0;
        document.getElementById('numbering').style.opacity = "1";

    } else {

        document.getElementById('numbering').style.opacity = "0";

        deleteDuplication = false;
        words = ["指鹿爲馬", "毛遂自薦", "伯牙絶絃", "斷機之戒", "昏定晨省", "咸興差使", "群鷄一鶴", "畫蛇添足", "刻舟求劍", "守株待兔", "脣亡齒寒", "愚公移山", "塞翁之馬", "君子不器", "益者三友", "同病相憐", "背水之陣", "螢雪之功", "擧世皆濁", "君舟民水", "任重道遠", "我是他非", "怪而不改", "錦上添花", "雪上加霜", "有名無實", "千萬多幸", "三思考慮", "表裏不同", "面從腹背", "口蜜腹劍", "兔死狗烹", "鷄鳴狗盜", "竹馬故友", "三三五五", "意氣投合", "刮目相對"]
        meanings = ["지록위마: 윗사람을 속이기 위해 사실을 왜곡함", "모수자천: 스스로를 추천함", "백아절현: 알아주는 이의 죽음을 슬퍼함", "단기지계: 자식을 엄하게 가르침", "혼정신성: 부모를 지극히 섬김", "함흥차사: 심부름 간 사람이 돌아오지 않음", "군계일학: 많은 평범한 것 속에서 뛰어난 존재", "화사첨족: 쓸데없는 일을 덧붙여 일을 망침", "각주구검: 융통성 없이 옛 방법만 고집함", "수주대토: 요행을 바라고 노력하지 않음", "순망치한: 서로 의지하는 관계", "우공이산: 끈기 있게 노력하면 이룸", "새옹지마: 인생의 길흉화복은 예측 불가", "군자불기: 군자는 한 가지 용도에 얽매이지 않음", "익자삼우: 사귀면 이로운 세 가지 친구", "동병상련: 같은 처지끼리 서로 이해함", "배수지진: 물러설 곳 없이 결사적으로 싸움", "형설지공: 어려운 환경에서도 학문에 힘씀", "거세개탁: 온 세상이 모두 흐림(세상이 혼탁함)", "군주민수: 백성은 물, 군주는 배 (백성이 나라의 근본)", "임중도원: 책임은 무겁고 갈 길은 멂", "아시타비: 나는 옳고 남은 틀림", "괴이불개: 잘못을 알고도 고치지 않음", "금상첨화: 좋은 일에 또 좋은 일이 더해짐", "설상가상: 불행 위에 불행이 겹침", "유명무실: 이름뿐이고 실속이 없음", "천만다행: 아주 다행스러운 일", "삼사고려: 여러 번 깊이 생각함", "표리부동: 겉과 속이 다름", "면종복배: 겉으로는 따르고 속으로는 배반함", "구밀복검: 말은 달콤하나 속은 음흉함", "토사구팽: 필요 없으면 버림", "계명구도: 하찮은 재주(쓸모없는 잔재주)", "죽마고우: 어릴 때부터 친한 친구", "삼삼오오: 몇몇이 떼 지어 다님", "의기투합: 뜻이 서로 맞아 잘 어울림", "괄목상대: 눈을 비비고 다시 볼 만큼 크게 발전함"]
    }
}

let words = ["指鹿爲馬", "毛遂自薦", "伯牙絶絃", "斷機之戒", "昏定晨省", "咸興差使", "群鷄一鶴", "畫蛇添足", "刻舟求劍", "守株待兔", "脣亡齒寒", "愚公移山", "塞翁之馬", "君子不器", "益者三友", "同病相憐", "背水之陣", "螢雪之功", "擧世皆濁", "君舟民水", "任重道遠", "我是他非", "怪而不改", "錦上添花", "雪上加霜", "有名無實", "千萬多幸", "三思考慮", "表裏不同", "面從腹背", "口蜜腹劍", "兔死狗烹", "鷄鳴狗盜", "竹馬故友", "三三五五", "意氣投合", "刮目相對"]
let meanings = ["지록위마: 윗사람을 속이기 위해 사실을 왜곡함", "모수자천: 스스로를 추천함", "백아절현: 알아주는 이의 죽음을 슬퍼함", "단기지계: 자식을 엄하게 가르침", "혼정신성: 부모를 지극히 섬김", "함흥차사: 심부름 간 사람이 돌아오지 않음", "군계일학: 많은 평범한 것 속에서 뛰어난 존재", "화사첨족: 쓸데없는 일을 덧붙여 일을 망침", "각주구검: 융통성 없이 옛 방법만 고집함", "수주대토: 요행을 바라고 노력하지 않음", "순망치한: 서로 의지하는 관계", "우공이산: 끈기 있게 노력하면 이룸", "새옹지마: 인생의 길흉화복은 예측 불가", "군자불기: 군자는 한 가지 용도에 얽매이지 않음", "익자삼우: 사귀면 이로운 세 가지 친구", "동병상련: 같은 처지끼리 서로 이해함", "배수지진: 물러설 곳 없이 결사적으로 싸움", "형설지공: 어려운 환경에서도 학문에 힘씀", "거세개탁: 온 세상이 모두 흐림(세상이 혼탁함)", "군주민수: 백성은 물, 군주는 배 (백성이 나라의 근본)", "임중도원: 책임은 무겁고 갈 길은 멂", "아시타비: 나는 옳고 남은 틀림", "괴이불개: 잘못을 알고도 고치지 않음", "금상첨화: 좋은 일에 또 좋은 일이 더해짐", "설상가상: 불행 위에 불행이 겹침", "유명무실: 이름뿐이고 실속이 없음", "천만다행: 아주 다행스러운 일", "삼사고려: 여러 번 깊이 생각함", "표리부동: 겉과 속이 다름", "면종복배: 겉으로는 따르고 속으로는 배반함", "구밀복검: 말은 달콤하나 속은 음흉함", "토사구팽: 필요 없으면 버림", "계명구도: 하찮은 재주(쓸모없는 잔재주)", "죽마고우: 어릴 때부터 친한 친구", "삼삼오오: 몇몇이 떼 지어 다님", "의기투합: 뜻이 서로 맞아 잘 어울림", "괄목상대: 눈을 비비고 다시 볼 만큼 크게 발전함"]
var nextMeaning;

function mixWords() {
    if (words.length > 0) {
        document.getElementById('wordMeanings').style.opacity = "0";

        let r = Math.floor(Math.random() * words.length);

        document.getElementById('randomWords').innerHTML = words[r];
        document.getElementById('wordMeanings').innerHTML = meanings[r];

        if (deleteDuplication == true) {

            numberCounter++;
            document.getElementById('numbering').innerHTML = `현재까지 나온 단어 수: ${numberCounter}/37개`;

            if (!nextMeaning) nextMeaning = '';

            let e = document.getElementById('list');
            e.innerHTML = e.innerHTML + `${nextMeaning}<br>${words[r]} - `;

            nextMeaning = meanings[r];

            words.splice(r, 1);
            meanings.splice(r, 1);
        }
    } else {
        document.getElementById('randomWords').innerHTML = '모든 단어를 학습했어요.';
        document.getElementById('wordMeanings').innerHTML = '새로고침으로 복습할 수 있어요.';
    }

}

function wordMeanings() {
    document.getElementById('wordMeanings').style.opacity = "1";
}